tap 'FiloSottile/gomod'
cask_args appdir: '/Applications'

brew 'asciinema'
brew 'asdf'
brew 'bitwarden-cli'
brew 'brew-gomod'
brew 'ccls'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'fd'
brew 'figlet'
brew 'fzf'
brew 'gdb'
brew 'git'
brew 'gnupg'
brew 'grc'
brew 'highlight'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'lolcat'
brew 'mas'
brew 'neovim'
brew 'nnn'
brew 'openssl'
brew 'pandoc'
brew 'pinentry-mac'
brew 'proselint'
brew 'ragel'
brew 'reattach-to-user-namespace'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'urlview'
brew 'wget'
brew 'youtube-dl'
brew 'z'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'blender'
cask 'caffeine'
cask 'coderunner'
cask 'dash'
cask 'discord'
cask 'eagle'
cask 'google-chrome'
cask 'grammarly'
cask 'hammerspoon'
cask 'iterm2'
cask 'loopback'
cask 'obs'
cask 'omnigraffle'
cask 'steam'
cask 'transmit'
cask 'vagrant'
cask 'vagrant-vmware-utility'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'zoomus'

mas '1Password 7 - Password Manager', id: 1333542190
mas 'Adblock Plus', id: 1432731683
mas 'Bear', id: 1091189122
mas 'Bitwarden', id: 1352778147
mas 'Clocker', id: 1056643111
mas 'Fantastical', id: 975937182
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Mindnode', id: 1289197285
mas 'Monodraw', id: 920404675
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Patterns', id: 429449079
mas 'Pixelmator', id: 407963104
mas 'RESTed', id: 421879749
mas 'Redacted', id: 984968384
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'Studies', id: 1071676469
mas 'Tailscale', id: 1475387142
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Xcode', id: 497799835
mas 'iA Writer', id: 775737590
