def custom_cask(name)
  root = File.expand_path('~/.brew')
  path = File.join(root, 'cask', "#{name}.rb")
  cask path
end

cask_args appdir: '/Applications'

brew 'chruby'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'docker'
brew 'docker-machine'
brew 'elm'
brew 'fd'
brew 'figlet'
brew 'fzf'
brew 'gdb'
brew 'git'
brew 'gnupg'
brew 'golang'
brew 'graphviz'
brew 'grc'
brew 'highlight'
brew 'hub'
brew 'jq'
brew 'lolcat'
brew 'mas'
brew 'neovim'
brew 'nvm'
brew 'pandoc'
brew 'proselint'
brew 'ragel'
brew 'reattach-to-user-namespace'
brew 'ruby-install'
brew 'shellcheck'
brew 'the_silver_searcher'
brew 'tmux'
brew 'urlview'
brew 'yarn'
brew 'youtube-dl'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'coderunner'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'gitter'
cask 'google-chrome'
cask 'grammarly'
cask 'kobo'
cask 'mactex'
cask 'signal'
cask 'steam'
cask 'sublime-text'
cask 'texpad'
cask 'transmit'
cask 'vagrant'
cask 'vanilla'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'

custom_cask 'orion'

mas '1Password 7 - Password Manager', id: 1333542190
mas 'Fantastical', id: 975937182
mas 'Ghostery Lite', id: 1436953057
mas 'Keynote', id: 409183694
mas 'Mindnode', id: 1289197285
mas 'Monodraw', id: 920404675
mas 'Moom', id: 419330170
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Patterns', id: 429449079
mas 'Pixelmator Pro', id: 1289583905
mas 'RESTed', id: 421879749
mas 'Redacted', id: 984968384
mas 'Simplenote', id: 692867256
mas 'Slack', id: 803453959
mas 'Spark', id: 1176895641
mas 'Studies', id: 1071676469
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
mas 'Tweetbot', id: 557168941
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Xcode', id: 497799835
mas 'iA Writer', id: 775737590
