tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'yt-dlp/taps'
cask_args appdir: '/Applications'

brew 'asciinema'
brew 'asdf'
brew 'bitwarden-cli'
brew 'ccls'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'fd'
brew 'figlet'
brew 'fzf'
brew 'git'
brew 'gnupg'
brew 'grc'
brew 'highlight'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'lolcat'
brew 'mas'
brew 'neovim'
brew 'nnn'
brew 'openssl'
brew 'pandoc'
brew 'pinentry-mac'
brew 'proselint'
brew 'ragel'
brew 'reattach-to-user-namespace'
brew 'shellcheck'
brew 'starship'
brew 'the_silver_searcher'
brew 'tmux'
brew 'urlview'
brew 'wget'
brew 'yt-dlp'
brew 'z'
brew 'zlib'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'blender'
cask 'caffeine'
cask 'canon-eos-webcam-utility'
cask 'dash'
cask 'discord'
cask 'google-chrome'
cask 'grammarly'
cask 'hammerspoon'
cask 'insomnia'
cask 'iterm2'
cask 'loopback'
cask 'ngrok'
cask 'obs'
cask 'postico'
cask 'quitter'
cask 'steam'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'

mas '1Password', id: 1333542190
mas 'Bear', id: 1091189122
mas 'Fantastical - Calendar & Tasks', id: 975937182
mas 'Goodnotes 5', id: 1444383602
mas 'Keynote', id: 409183694
mas 'Kindle', id: 405399194
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Mindnode', id: 1289197285
mas 'Monodraw', id: 920404675
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Patterns', id: 429449079
mas 'Pixelmator', id: 407963104
mas 'Redacted', id: 984968384
mas 'Slack', id: 803453959
mas 'Studies', id: 1071676469
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Xcode', id: 497799835
mas 'iA Writer', id: 775737590
